app/controllers/categories_controller.rb

  def index
  @category=Category.all
---
SELECT "categories".* FROM "categories"